stm32-rs/stm32wlxx-hal/gpio/src/lib.rs
//! General-purpose input/output pins.
//!
//! # Safety
//!
//! This crate relies upon exclusive access to registers via disabling and
//! re-enabling interrupts.
//! Dual core systems can easily bypass this.
//! You are responsible for ensuring exclusive access between cores for all
//! structures in this crate.
#![cfg_attr(not(test), no_std)]
#![cfg_attr(docsrs, feature(doc_cfg))]
#![deny(missing_docs)]

use core::ptr::{read_volatile, write_volatile};
use cortex_m::interrupt::CriticalSection;

cfg_if::cfg_if! {
    if #[cfg(feature = "stm32wl5x_cm0p")] {
        /// Peripheral access crate.
        pub use stm32wl::stm32wl5x_cm0p as pac;
    } else if #[cfg(feature = "stm32wl5x_cm4")] {
        /// Peripheral access crate.
        pub use stm32wl::stm32wl5x_cm4 as pac;
    } else if #[cfg(feature = "stm32wle5")] {
        /// Peripheral access crate.
        pub use stm32wl::stm32wle5 as pac;
    } else {
        core::compile_error!("You must select your hardware with a feature flag");
    }
}

/// GPIO output types.
#[repr(u8)]
#[derive(Debug, PartialEq, Eq, Clone, Copy)]
pub enum OutputType {
    /// Push-pull output.
    PushPull = 0b0,
    /// Open-drain output.
    ///
    /// This is typically used with [`Pull::Up`].
    OpenDrain = 0b1,
}

/// GPIO speeds.
///
/// Refer to the device datasheet for the frequency specifications and the power
/// supply and load conditions for each speed.
#[repr(u8)]
#[derive(Debug, PartialEq, Eq, Clone, Copy)]
#[allow(missing_docs)]
pub enum Speed {
    Low = 0b00,
    Medium = 0b01,
    Fast = 0b10,
    High = 0b11,
}

/// GPIO pull-up and pull-down.
#[repr(u8)]
#[derive(Debug, PartialEq, Eq, Clone, Copy)]
#[non_exhaustive] // maybe they will use that reserved value one day...
pub enum Pull {
    /// No pull-up, no pull-down.
    None = 0b00,
    /// Pull-up.
    Up = 0b01,
    /// Pull-down.
    Down = 0b10,
}

#[derive(Debug)]
struct Pin<const BASE: usize, const N: u8> {}

impl<const BASE: usize, const N: u8> Pin<BASE, N> {
    const MODER_R: *const u32 = BASE as *const u32;
    const MODER_W: *mut u32 = BASE as *mut u32;
    const OTYPER_R: *const u32 = (BASE + 0x4) as *const u32;
    const OTYPER_W: *mut u32 = (BASE + 0x4) as *mut u32;
    const OSPEEDR_R: *const u32 = (BASE + 0x8) as *const u32;
    const OSPEEDR_W: *mut u32 = (BASE + 0x8) as *mut u32;
    const PUPDR_R: *const u32 = (BASE + 0xC) as *const u32;
    const PUPDR_W: *mut u32 = (BASE + 0xC) as *mut u32;
    const IDR: *const u32 = (BASE + 0x10) as *const u32;
    const ODR: *const u32 = (BASE + 0x14) as *const u32;
    const BSRR: *mut u32 = (BASE + 0x18) as *mut u32;

    const AF: usize = if N > 7 { BASE + 0x24 } else { BASE + 0x20 };
    const AF_R: *const u32 = Self::AF as *const u32;
    const AF_W: *mut u32 = Self::AF as *mut u32;
    const AF_SHIFT: u8 = if N > 7 { 1 << (N - 7) } else { 1 << N };

    pub(crate) const fn new() -> Pin<BASE, N> {
        Pin {}
    }

    #[inline(always)]
    pub(crate) unsafe fn set_mode(&mut self, _cs: &CriticalSection, mode: sealed::Mode) {
        let mut val: u32 = read_volatile(Self::MODER_R);
        val &= !(0b11 << (N * 2));
        val |= (mode as u8 as u32) << (N * 2);
        write_volatile(Self::MODER_W, val);
    }

    #[inline(always)]
    pub(crate) unsafe fn set_output_type(&mut self, _cs: &CriticalSection, ot: OutputType) {
        let mut val: u32 = read_volatile(Self::OTYPER_R);
        match ot {
            OutputType::PushPull => val &= !(1 << N),
            OutputType::OpenDrain => val |= 1 << N,
        }
        write_volatile(Self::OTYPER_W, val);
    }

    #[inline(always)]
    pub(crate) unsafe fn set_speed(&mut self, _cs: &CriticalSection, speed: Speed) {
        let mut val: u32 = read_volatile(Self::OSPEEDR_R);
        val &= !(0b11 << (N * 2));
        val |= (speed as u8 as u32) << (N * 2);
        write_volatile(Self::OSPEEDR_W, val);
    }

    #[inline(always)]
    pub(crate) unsafe fn set_pull(&mut self, _cs: &CriticalSection, pull: Pull) {
        let mut val: u32 = read_volatile(Self::PUPDR_R);
        val &= !(0b11 << (N * 2));
        val |= (pull as u8 as u32) << (N * 2);
        write_volatile(Self::PUPDR_W, val);
    }

    #[inline(always)]
    pub(crate) fn input_level(&self) -> Level {
        if unsafe { read_volatile(Self::IDR) } & (1 << N) == 0 {
            Level::Low
        } else {
            Level::High
        }
    }

    #[inline(always)]
    pub(crate) fn output_level(&self) -> Level {
        if unsafe { read_volatile(Self::ODR) } & (1 << N) == 0 {
            Level::Low
        } else {
            Level::High
        }
    }

    #[inline(always)]
    pub(crate) fn set_output_level(&mut self, level: Level) {
        let val: u32 = match level {
            Level::Low => 1 << (N + 16),
            Level::High => 1 << N,
        };
        unsafe { write_volatile(Self::BSRR, val) }
    }

    #[inline(always)]
    pub(crate) unsafe fn set_alternate_function(&mut self, cs: &CriticalSection, af: u8) {
        self.set_mode(cs, sealed::Mode::Alternate);
        let mut val: u32 = read_volatile(Self::AF_R);
        val &= !(0b1111 << Self::AF_SHIFT);
        val |= (af as u8 as u32) << Self::AF_SHIFT;
        write_volatile(Self::AF_W, val);
    }
}

pub(crate) mod sealed {
    use super::{CriticalSection, Level, OutputType, Pull, Speed};

    /// GPIO modes.
    #[repr(u8)]
    pub enum Mode {
        Input = 0b00,
        Output = 0b01,
        Alternate = 0b10,
        Analog = 0b11,
    }

    /// This is the same methods as Pin, but in a trait so that the individual
    /// Pin structures can implement it in a light wrapper without putting a ton
    /// of code into the macro which will result in longer compile times.
    pub trait PinOps {
        unsafe fn set_mode(&mut self, cs: &CriticalSection, mode: Mode);
        unsafe fn set_output_type(&mut self, cs: &CriticalSection, ot: OutputType);
        unsafe fn set_speed(&mut self, cs: &CriticalSection, speed: Speed);
        unsafe fn set_pull(&mut self, cs: &CriticalSection, pull: Pull);
        fn input_level(&self) -> Level;
        fn output_level(&self) -> Level;
        fn set_output_level(&mut self, level: Level);
        unsafe fn set_alternate_function(&mut self, cs: &CriticalSection, af: u8);
    }
}

/// GPIO pins
pub mod pins {
    // Switch to this when avaliable on stable
    // https://github.com/rust-lang/rust/issues/51910
    // const GPIOA_BASE: usize = pac::GPIOA::ptr() as *const _ as usize;
    // const GPIOB_BASE: usize = pac::GPIOB::ptr() as *const _ as usize;
    // const GPIOC_BASE: usize = pac::GPIOC::ptr() as *const _ as usize;

    const GPIOA_BASE: usize = 0x4800_0000;
    const GPIOB_BASE: usize = 0x4800_0400;
    const GPIOC_BASE: usize = 0x4800_0800;

    use super::{CriticalSection, Level, OutputType, Pin, Pull, Speed};

    macro_rules! gpio_struct {
        ($name:ident, $base:expr, $n:expr, $doc:expr) => {
            #[doc=$doc]
            #[derive(Debug)]
            pub struct $name {
                pin: Pin<$base, $n>,
            }

