stm32-rs/stm32wlxx-hal/gpio/src/lib.rs
            impl $name {
                pub(crate) const fn new() -> Self {
                    $name { pin: Pin::new() }
                }
            }

            impl crate::sealed::PinOps for $name {
                #[inline(always)]
                unsafe fn set_mode(&mut self, cs: &CriticalSection, mode: crate::sealed::Mode) {
                    self.pin.set_mode(cs, mode)
                }

                #[inline(always)]
                unsafe fn set_output_type(&mut self, cs: &CriticalSection, ot: OutputType) {
                    self.pin.set_output_type(cs, ot)
                }

                #[inline(always)]
                unsafe fn set_speed(&mut self, cs: &CriticalSection, speed: Speed) {
                    self.pin.set_speed(cs, speed)
                }

                #[inline(always)]
                unsafe fn set_pull(&mut self, cs: &CriticalSection, pull: Pull) {
                    self.pin.set_pull(cs, pull)
                }

                #[inline(always)]
                fn input_level(&self) -> Level {
                    self.pin.input_level()
                }

                #[inline(always)]
                fn output_level(&self) -> Level {
                    self.pin.output_level()
                }

                #[inline(always)]
                fn set_output_level(&mut self, level: Level) {
                    self.pin.set_output_level(level)
                }

                #[inline(always)]
                unsafe fn set_alternate_function(&mut self, cs: &CriticalSection, af: u8) {
                    self.pin.set_alternate_function(cs, af)
                }
            }
        };
    }

    gpio_struct!(A0, GPIOA_BASE, 0, "Port A pin 0");
    gpio_struct!(A1, GPIOA_BASE, 1, "Port A pin 1");
    gpio_struct!(A2, GPIOA_BASE, 2, "Port A pin 2");
    gpio_struct!(A3, GPIOA_BASE, 3, "Port A pin 3");
    gpio_struct!(A4, GPIOA_BASE, 4, "Port A pin 4");
    gpio_struct!(A5, GPIOA_BASE, 5, "Port A pin 5");
    gpio_struct!(A6, GPIOA_BASE, 6, "Port A pin 6");
    gpio_struct!(A7, GPIOA_BASE, 7, "Port A pin 7");
    gpio_struct!(A8, GPIOA_BASE, 8, "Port A pin 8");
    gpio_struct!(A9, GPIOA_BASE, 9, "Port A pin 9");
    gpio_struct!(A10, GPIOA_BASE, 10, "Port A pin 10");
    gpio_struct!(A11, GPIOA_BASE, 11, "Port A pin 11");
    gpio_struct!(A12, GPIOA_BASE, 12, "Port A pin 12");
    gpio_struct!(A13, GPIOA_BASE, 13, "Port A pin 13");
    gpio_struct!(A14, GPIOA_BASE, 14, "Port A pin 14");
    gpio_struct!(A15, GPIOA_BASE, 15, "Port A pin 15");

    gpio_struct!(B0, GPIOB_BASE, 0, "Port B pin 0");
    gpio_struct!(B1, GPIOB_BASE, 1, "Port B pin 1");
    gpio_struct!(B2, GPIOB_BASE, 2, "Port B pin 2");
    gpio_struct!(B3, GPIOB_BASE, 3, "Port B pin 3");
    gpio_struct!(B4, GPIOB_BASE, 4, "Port B pin 4");
    gpio_struct!(B5, GPIOB_BASE, 5, "Port B pin 5");
    gpio_struct!(B6, GPIOB_BASE, 6, "Port B pin 6");
    gpio_struct!(B7, GPIOB_BASE, 7, "Port B pin 7");
    gpio_struct!(B8, GPIOB_BASE, 8, "Port B pin 8");
    gpio_struct!(B9, GPIOB_BASE, 9, "Port B pin 9");
    gpio_struct!(B10, GPIOB_BASE, 10, "Port B pin 10");
    gpio_struct!(B11, GPIOB_BASE, 11, "Port B pin 11");
    gpio_struct!(B12, GPIOB_BASE, 12, "Port B pin 12");
    gpio_struct!(B13, GPIOB_BASE, 13, "Port B pin 13");
    gpio_struct!(B14, GPIOB_BASE, 14, "Port B pin 14");
    gpio_struct!(B15, GPIOB_BASE, 15, "Port B pin 15");

    gpio_struct!(C0, GPIOC_BASE, 0, "Port C pin 0");
    gpio_struct!(C1, GPIOC_BASE, 1, "Port C pin 1");
    gpio_struct!(C2, GPIOC_BASE, 2, "Port C pin 2");
    gpio_struct!(C3, GPIOC_BASE, 3, "Port C pin 3");
    gpio_struct!(C4, GPIOC_BASE, 4, "Port C pin 4");
    gpio_struct!(C5, GPIOC_BASE, 5, "Port C pin 5");
    gpio_struct!(C6, GPIOC_BASE, 6, "Port C pin 6");
    gpio_struct!(C13, GPIOC_BASE, 13, "Port C pin 13");
    gpio_struct!(C14, GPIOC_BASE, 14, "Port C pin 14");
    gpio_struct!(C15, GPIOC_BASE, 15, "Port C pin 15");
}

/// Port A GPIOs
#[derive(Debug)]
#[allow(missing_docs)]
pub struct PortA {
    pub pa0: pins::A0,
    pub pa1: pins::A1,
    pub pa2: pins::A2,
    pub pa3: pins::A3,
    pub pa4: pins::A4,
    pub pa5: pins::A5,
    pub pa6: pins::A6,
    pub pa7: pins::A7,
    pub pa8: pins::A8,
    pub pa9: pins::A9,
    pub pa10: pins::A10,
    pub pa11: pins::A11,
    pub pa12: pins::A12,
    pub pa13: pins::A13,
    pub pa14: pins::A14,
    pub pa15: pins::A15,
}

impl PortA {
    /// Enable GPIO port A and split the port into individual pins.
    ///
    /// # Example
    ///
    /// Get GPIO A0.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, PortA};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let gpioa: PortA = PortA::split(dp.GPIOA, &mut dp.RCC);
    /// let pa0: pins::A0 = gpioa.pa0;
    /// ```
    #[allow(unused_variables)]
    pub fn split(gpioa: pac::GPIOA, rcc: &mut pac::RCC) -> Self {
        rcc.ahb2enr.modify(|_, w| w.gpioaen().set_bit());
        rcc.ahb2enr.read(); // delay after an RCC peripheral clock enabling
        const RET: PortA = PortA {
            pa0: pins::A0::new(),
            pa1: pins::A1::new(),
            pa2: pins::A2::new(),
            pa3: pins::A3::new(),
            pa4: pins::A4::new(),
            pa5: pins::A5::new(),
            pa6: pins::A6::new(),
            pa7: pins::A7::new(),
            pa8: pins::A8::new(),
            pa9: pins::A9::new(),
            pa10: pins::A10::new(),
            pa11: pins::A11::new(),
            pa12: pins::A12::new(),
            pa13: pins::A13::new(),
            pa14: pins::A14::new(),
            pa15: pins::A15::new(),
        };

        RET
    }
}

/// Port B GPIOs
#[derive(Debug)]
#[allow(missing_docs)]
pub struct PortB {
    pub pb0: pins::B0,
    pub pb1: pins::B1,
    pub pb2: pins::B2,
    pub pb3: pins::B3,
    pub pb4: pins::B4,
    pub pb5: pins::B5,
    pub pb6: pins::B6,
    pub pb7: pins::B7,
    pub pb8: pins::B8,
    pub pb9: pins::B9,
    pub pb10: pins::B10,
    pub pb11: pins::B11,
    pub pb12: pins::B12,
    pub pb13: pins::B13,
    pub pb14: pins::B14,
    pub pb15: pins::B15,
}

impl PortB {
    /// Enable GPIO port B and split the port into individual pins.
    ///
    /// # Example
    ///
    /// Get GPIO B0.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, PortB};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let gpiob: PortB = PortB::split(dp.GPIOB, &mut dp.RCC);
    /// let pb0: pins::B0 = gpiob.pb0;
    /// ```
    #[allow(unused_variables)]
    pub fn split(gpiob: pac::GPIOB, rcc: &mut pac::RCC) -> Self {
        rcc.ahb2enr.modify(|_, w| w.gpioben().set_bit());
        rcc.ahb2enr.read(); // delay after an RCC peripheral clock enabling
        const RET: PortB = PortB {
            pb0: pins::B0::new(),
            pb1: pins::B1::new(),
            pb2: pins::B2::new(),
            pb3: pins::B3::new(),
            pb4: pins::B4::new(),
            pb5: pins::B5::new(),
            pb6: pins::B6::new(),
            pb7: pins::B7::new(),
            pb8: pins::B8::new(),
            pb9: pins::B9::new(),
            pb10: pins::B10::new(),
            pb11: pins::B11::new(),
            pb12: pins::B12::new(),
            pb13: pins::B13::new(),
            pb14: pins::B14::new(),
            pb15: pins::B15::new(),
        };

        RET
    }
}

