stm32-rs/stm32wlxx-hal/gpio/src/lib.rs
/// Port C GPIOs
#[derive(Debug)]
#[allow(missing_docs)]
pub struct PortC {
    pub pc0: pins::C0,
    pub pc1: pins::C1,
    pub pc2: pins::C2,
    pub pc3: pins::C3,
    pub pc4: pins::C4,
    pub pc5: pins::C5,
    pub pc6: pins::C6,
    pub pc13: pins::C13,
    pub pc14: pins::C14,
    pub pc15: pins::C15,
}

impl PortC {
    /// Enable GPIO port C and split the port into individual pins.
    ///
    /// # Example
    ///
    /// Get GPIO C0.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, PortC};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let pc0: pins::C0 = gpioc.pc0;
    /// ```
    #[allow(unused_variables)]
    pub fn split(gpioc: pac::GPIOC, rcc: &mut pac::RCC) -> Self {
        rcc.ahb2enr.modify(|_, w| w.gpiocen().set_bit());
        rcc.ahb2enr.read(); // delay after an RCC peripheral clock enabling
        const RET: PortC = PortC {
            pc0: pins::C0::new(),
            pc1: pins::C1::new(),
            pc2: pins::C2::new(),
            pc3: pins::C3::new(),
            pc4: pins::C4::new(),
            pc5: pins::C5::new(),
            pc6: pins::C6::new(),
            pc13: pins::C13::new(),
            pc14: pins::C14::new(),
            pc15: pins::C15::new(),
        };

        RET
    }
}

/// Digital input or output level.
#[derive(Debug, Eq, PartialEq, PartialOrd, Ord, Clone, Copy, Hash)]
pub enum Level {
    /// GPIO logic low.
    Low,
    /// GPIO logic high.
    High,
}

impl Level {
    /// Toggle the level.
    ///
    /// # Example
    ///
    /// ```
    /// use stm32wl_hal_gpio::Level;
    ///
    /// assert_eq!(Level::High.toggle(), Level::Low);
    /// assert_eq!(Level::Low.toggle(), Level::High);
    /// ```
    pub const fn toggle(self) -> Level {
        match self {
            Level::Low => Level::High,
            Level::High => Level::Low,
        }
    }
}

/// Output pin arguments.
///
/// Argument of [`Output::new`].
#[derive(Debug, PartialEq, Eq, Clone, Copy)]
pub struct OutputArgs {
    /// Output speed.
    pub speed: Speed,
    /// Initial output level.
    pub level: Level,
    /// Output type.
    pub ot: OutputType,
    /// IO pull configuration.
    ///
    /// This is only used if the output type is [`OutputType::OpenDrain`].
    pub pull: Pull,
}

impl OutputArgs {
    /// Create a new `OutputArgs` struct.
    ///
    /// This is the same as `default`, but in a `const` fn.
    ///
    /// # Example
    ///
    /// ```
    /// use stm32wl_hal_gpio::OutputArgs;
    ///
    /// assert_eq!(OutputArgs::new(), OutputArgs::default());
    /// ```
    pub const fn new() -> Self {
        OutputArgs {
            speed: Speed::High,
            level: Level::Low,
            ot: OutputType::PushPull,
            pull: Pull::None,
        }
    }
}

impl Default for OutputArgs {
    fn default() -> Self {
        Self::new()
    }
}

/// Output pin.
#[derive(Debug)]
pub struct Output<P> {
    pin: P,
}

impl<P> Output<P>
where
    P: sealed::PinOps,
{
    /// Create a new output pin from a GPIO.
    ///
    /// # Example
    ///
    /// Configure GPIO port C3, C4, C5 as outputs.
    /// These are the GPIOs for the RF switch on the NUCLEO-WL55JC2.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Level, Output, OutputArgs, OutputType, PortC, Pull, Speed};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    ///
    /// const OUTPUT_ARGS: OutputArgs = OutputArgs {
    ///     level: Level::Low,
    ///     speed: Speed::High,
    ///     ot: OutputType::PushPull,
    ///     pull: Pull::None,
    /// };
    ///
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc3: Output<pins::C3> = Output::new(gpioc.pc3, &OUTPUT_ARGS);
    /// let mut pc4: Output<pins::C4> = Output::new(gpioc.pc4, &OUTPUT_ARGS);
    /// let mut pc5: Output<pins::C5> = Output::new(gpioc.pc5, &OUTPUT_ARGS);
    /// ```
    pub fn new(mut pin: P, args: &OutputArgs) -> Self {
        cortex_m::interrupt::free(|cs| unsafe {
            pin.set_output_type(cs, args.ot);
            if args.ot == OutputType::OpenDrain {
                pin.set_pull(cs, args.pull)
            } else {
                pin.set_pull(cs, Pull::None)
            }
            pin.set_speed(cs, args.speed);
            pin.set_output_level(args.level);
            pin.set_mode(cs, sealed::Mode::Output);
        });
        Output { pin }
    }

    /// Create a new output pin from a GPIO using the default settings.
    ///
    /// # Example
    ///
    /// Configure GPIO C0 as an output.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Output, OutputArgs, PortC};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    ///
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc0: Output<pins::C0> = Output::default(gpioc.pc0);
    /// ```
    pub fn default(pin: P) -> Self {
        Self::new(pin, &OutputArgs::new())
    }

    /// Free the GPIO pin.
    ///
    /// This will reconfigure the GPIO as a floating input.
    ///
    /// # Example
    ///
    /// Configure a GPIO as an output, then free it.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Output, PortC};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    ///
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let pc0_output: Output<pins::C0> = Output::default(gpioc.pc0);
    /// let pc0: pins::C0 = pc0_output.free();
    /// ```
    pub fn free(mut self) -> P {
        cortex_m::interrupt::free(|cs| unsafe {
            self.pin.set_pull(cs, Pull::None);
            self.pin.set_mode(cs, sealed::Mode::Input);
        });
        self.pin
    }

    /// Set the GPIO output level.
    ///
    /// This is the same as the `OutputPin` trait from the embedded hal, but
    /// without the `Infallible` result types.
    ///
    /// # Example
    ///
    /// Pulse a GPIO pin.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Level, Output, PortC};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    ///
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc0: Output<pins::C0> = Output::default(gpioc.pc0);
    /// pc0.set_output_level(Level::High);
    /// pc0.set_output_level(Level::High);
    /// ```
    pub fn set_output_level(&mut self, level: Level) {
        self.pin.set_output_level(level)
    }

    /// Get the current GPIO output level.
    ///
    /// # Example
    ///
    /// Toggle a GPIO pin.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Level, Output, PortC};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    ///
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc0: Output<pins::C0> = Output::default(gpioc.pc0);
    /// pc0.set_output_level(pc0.output_level().toggle());
    /// ```
    pub fn output_level(&self) -> Level {
        self.pin.output_level()
    }
}

#[cfg(feature = "embedded-hal")]
#[cfg_attr(docsrs, doc(cfg(feature = "embedded-hal")))]
impl<P> embedded_hal::digital::v2::OutputPin for Output<P>
where
    P: sealed::PinOps,
{
    type Error = core::convert::Infallible;

