stm32-rs/stm32wlxx-hal/gpio/src/lib.rs
    fn set_low(&mut self) -> Result<(), Self::Error> {
        self.pin.set_output_level(Level::Low);
        Ok(())
    }

    fn set_high(&mut self) -> Result<(), Self::Error> {
        self.pin.set_output_level(Level::High);
        Ok(())
    }
}

/// Input pin.
#[derive(Debug)]
pub struct Input<P> {
    pin: P,
}

impl<P> Input<P>
where
    P: sealed::PinOps,
{
    /// Create a new input pin from a GPIO.
    ///
    /// # Example
    ///
    /// Configure GPIO C6 as an input.
    /// This is the GPIO for button 3 on the NUCLEO-WL55JC2.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Input, PortC, Pull};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc6: Input<pins::C6> = Input::new(gpioc.pc6, Pull::Up);
    /// ```
    pub fn new(mut pin: P, pull: Pull) -> Self {
        cortex_m::interrupt::free(|cs| unsafe {
            pin.set_pull(cs, pull);
            pin.set_output_type(cs, OutputType::PushPull);
            pin.set_mode(cs, sealed::Mode::Input);
        });
        Input { pin }
    }

    /// Create a new input pin from a GPIO with default settings.
    ///
    /// # Example
    ///
    /// Configure GPIO C0 as an input.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Input, PortC};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc0: Input<pins::C0> = Input::default(gpioc.pc0);
    /// ```
    pub fn default(pin: P) -> Self {
        Self::new(pin, Pull::None)
    }

    /// Get the input level.
    ///
    /// # Example
    ///
    /// Get the input level of C6.
    /// This is the GPIO for button 3 on the NUCLEO-WL55JC2.
    ///
    /// ```no_run
    /// use stm32wl_hal_gpio::{pac, pins, Input, Level, PortC, Pull};
    ///
    /// let mut dp: pac::Peripherals = pac::Peripherals::take().unwrap();
    /// let gpioc: PortC = PortC::split(dp.GPIOC, &mut dp.RCC);
    /// let mut pc6: Input<pins::C6> = Input::new(gpioc.pc6, Pull::Up);
    ///
    /// let button_3_is_pressed: bool = pc6.level() == Level::High;
    /// ```
    pub fn level(&self) -> Level {
        self.pin.input_level()
    }
}
